app/views/students/courses.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = ?  [["student_id", 1]]
SELECT COUNT(*) FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = ?  [["student_id", 1]]
---
<h2>Enroll in new course</h2>
<% if @student.courses.count < Course.count %>