app/views/students/index.html.erb

        <td><%= student.start_date %></td>
        <td><%= student.awards.count %></td>
        <td><%= student.courses.count %></td>
---
SELECT COUNT(*) FROM "awards" WHERE "awards"."student_id" = ?  [["student_id", 1]]
SELECT COUNT(*) FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = ?  [["student_id", 1]]