app/views/students/show.html.erb

  <strong>Courses:</strong>
  <% if !@student.courses.empty? %>
---
SELECT  1 AS one FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = ? LIMIT ?  [["student_id", 6], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = ?  [["student_id", 1]]