app/views/awards/index.html.erb

SELECT  1 AS one FROM "awards" WHERE "awards"."student_id" = ? LIMIT ?  [["student_id", 1], ["LIMIT", 1]]
SELECT "awards".* FROM "awards" WHERE "awards"."student_id" = ?  [["student_id", 1]]
---
<h1> Awards for <%= @student.name %></h1>
<% if !@student.awards.empty? %>