app/views/courses/index.html.erb

SELECT COUNT(*) FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 1]]
---
        <td><%= course.name %></td>
        <td><%= course.students.count %></td>