app/controllers/awards_controller.rb

  def create
    @award = @student.awards.build(award_params)
# was @award = Award.new(award_params)

    respond_to do |format|
      if @award.save
---
INSERT INTO "awards" ("name", "year", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "lol"], ["year", 3], ["student_id", 1], ["created_at", "2018-02-28 15:55:23.705127"], ["updated_at", "2018-02-28 15:55:23.705127"]]

  def update
    respond_to do |format|
      if @award.update(award_params)
---
UPDATE "awards" SET "student_id" = ?, "updated_at" = ? WHERE "awards"."id" = ?  [["student_id", 2], ["updated_at", "2018-02-26 21:16:55.403871"], ["id", 1]]

  def destroy
    @award.destroy
---
DELETE FROM "awards" WHERE "awards"."id" = ?  [["id", 2]]

  def set_award
    @award = @student.awards.find(params[:id])
---
SELECT  "awards".* FROM "awards" WHERE "awards"."student_id" = ? AND "awards"."id" = ? LIMIT ?  [["student_id", 1], ["id", 9], ["LIMIT", 1]]