app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])