app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "lol"], ["created_at", "2018-03-05 21:40:36.486961"], ["updated_at", "2018-03-05 21:40:36.486961"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def roll
    @course = Course.find(params[:id])