app/controllers/students_controller.rb

INSERT INTO "students" ("given_name", "middle_name", "family_name", "date_of_birth", "grade_point_average", "start_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)
    respond_to do |format|
      if @student.save

UPDATE "students" SET "grade_point_average" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["grade_point_average", 4.5], ["updated_at", "2018-03-24 13:42:37.830159"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def courses
    @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def course_add
#Convert ids from routing to objects
    @student = Student.find(params[:id])
    @course = Course.find(params[:course])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def course_remove
#Convert ids from routing to object
    @student = Student.find(params[:id])
#get list of courses to remove from query string
    course_ids = params[:courses]
    if course_ids.any?
      course_ids.each do |course_id|
        course = Course.find(course_id)